Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
x_train (InputLayer)         [(None, 168, 187)]        0         
_________________________________________________________________
dnn1 (Dense)                 (None, 168, 504)          94752     
_________________________________________________________________
dnn_out (Dense)              (None, 168, 504)          254520    
_________________________________________________________________
dense_out (Dense)            (None, 168, 1)            505       
=================================================================
Total params: 349,777
Trainable params: 349,777
Non-trainable params: 0
_________________________________________________________________
