Model: "model_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
x_train (InputLayer)         [(None, 168, 187)]        0         
_________________________________________________________________
gru1 (GRU)                   (None, 168, 504)          1047816   
_________________________________________________________________
gru_out (GRU)                (None, 168, 504)          1527120   
_________________________________________________________________
dense_out (Dense)            (None, 168, 1)            505       
=================================================================
Total params: 2,575,441
Trainable params: 2,575,441
Non-trainable params: 0
_________________________________________________________________
