Model: "model_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
x_train (InputLayer)         [(None, 168, 187)]        0         
_________________________________________________________________
lstm1 (LSTM)                 (None, 168, 504)          1395072   
_________________________________________________________________
lstm_out (LSTM)              (None, 168, 504)          2034144   
_________________________________________________________________
dense_out (Dense)            (None, 168, 1)            505       
=================================================================
Total params: 3,429,721
Trainable params: 3,429,721
Non-trainable params: 0
_________________________________________________________________
