Model: "model_10"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_4 (InputLayer)         [(None, 120, 4)]          0         
_________________________________________________________________
flatten_3 (Flatten)          (None, 480)               0         
_________________________________________________________________
enc512 (Dense)               (None, 512)               246272    
_________________________________________________________________
layer_normalization_27 (Laye (None, 512)               1024      
_________________________________________________________________
enc384 (Dense)               (None, 384)               196992    
_________________________________________________________________
layer_normalization_28 (Laye (None, 384)               768       
_________________________________________________________________
enc256 (Dense)               (None, 256)               98560     
_________________________________________________________________
layer_normalization_29 (Laye (None, 256)               512       
_________________________________________________________________
encoder (Dense)              (None, 128)               32896     
_________________________________________________________________
layer_normalization_30 (Laye (None, 128)               256       
_________________________________________________________________
dec128 (Dense)               (None, 128)               16512     
_________________________________________________________________
layer_normalization_31 (Laye (None, 128)               256       
_________________________________________________________________
out (Dense)                  (None, 256)               33024     
_________________________________________________________________
layer_normalization_32 (Laye (None, 256)               512       
_________________________________________________________________
dec384 (Dense)               (None, 384)               98688     
_________________________________________________________________
layer_normalization_33 (Laye (None, 384)               768       
_________________________________________________________________
dec512 (Dense)               (None, 512)               197120    
_________________________________________________________________
layer_normalization_34 (Laye (None, 512)               1024      
_________________________________________________________________
decoder (Dense)              (None, 480)               246240    
_________________________________________________________________
layer_normalization_35 (Laye (None, 480)               960       
_________________________________________________________________
reshape_3 (Reshape)          (None, 120, 4)            0         
=================================================================
Total params: 1,172,384
Trainable params: 1,172,384
Non-trainable params: 0
_________________________________________________________________
