Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
x_train1 (InputLayer)           [(None, 168, 187)]   0                                            
__________________________________________________________________________________________________
lstm1_encoder (LSTM)            [(None, 168, 504), ( 1395072     x_train1[0][0]                   
__________________________________________________________________________________________________
repeat_h_lstm1_encoder (RepeatV (None, 168, 504)     0           lstm1_encoder[0][1]              
__________________________________________________________________________________________________
lstm2_decoder (LSTM)            (None, 168, 504)     2034144     repeat_h_lstm1_encoder[0][0]     
                                                                 lstm1_encoder[0][1]              
                                                                 lstm1_encoder[0][2]              
__________________________________________________________________________________________________
dot_stacks_dec_enc (Dot)        (None, 168, 168)     0           lstm2_decoder[0][0]              
                                                                 lstm1_encoder[0][0]              
__________________________________________________________________________________________________
attention (Activation)          (None, 168, 168)     0           dot_stacks_dec_enc[0][0]         
__________________________________________________________________________________________________
dot_attention_stackenc (Dot)    (None, 168, 504)     0           attention[0][0]                  
                                                                 lstm1_encoder[0][0]              
__________________________________________________________________________________________________
h_decoder_context (Concatenate) (None, 168, 1008)    0           dot_attention_stackenc[0][0]     
                                                                 lstm2_decoder[0][0]              
__________________________________________________________________________________________________
denseout1 (Dense)               (None, 168, 672)     678048      h_decoder_context[0][0]          
__________________________________________________________________________________________________
x_train2 (InputLayer)           [(None, 168, 4)]     0                                            
__________________________________________________________________________________________________
denseout2 (Dense)               (None, 168, 336)     226128      denseout1[0][0]                  
__________________________________________________________________________________________________
wad_lstm (LSTM)                 (None, 168, 504)     1026144     x_train2[0][0]                   
__________________________________________________________________________________________________
wide_and_deep (Concatenate)     (None, 168, 840)     0           denseout2[0][0]                  
                                                                 wad_lstm[0][0]                   
__________________________________________________________________________________________________
lstm_out (GRU)                  (None, 168, 504)     2035152     wide_and_deep[0][0]              
__________________________________________________________________________________________________
dense_out (Dense)               (None, 168, 1)       505         lstm_out[0][0]                   
==================================================================================================
Total params: 7,395,193
Trainable params: 7,395,193
Non-trainable params: 0
__________________________________________________________________________________________________
